---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.Weight
source: html/d4832e54-0611-c6e0-8121-8356f978eee9.htm
---
# Autodesk.Revit.DB.FabricationPart.Weight Property

The weight of the fabrication part.

## Syntax (C#)
```csharp
public double Weight { get; }
```